title: Temporary keychain created
id: 9087BBF0-EE66-454E-BBB4-B272E2EC8EFF
status: experimental
description: Detects creation of a temporary keychain. This artifact is created during Apfell implant startup as part of its session key generation
tags:
  - apfell
logsource:
  category: file_event
  product: macos
detection:
  selection:
    TargetFilename|startswith: '/private/var/folders'
    TargetFilename|endswith:
      - 'mds/mdsDirectory.db'
      - 'mds/mdsObject.db'
      - 'mds/mds.lock'

  falsePositive:
    Image:
      - '/usr/libexec/trustd'

  condition: selection and not falsePositive

falsepositives:
  - (unknown) Legitimate processes using temporary keychains
level: high
