title: Temporary keychain created
id: 9087BBF0-EE66-454E-BBB4-B272E2EC8EFF
description: Detects creation of a temporary keychain. This artifact is created during Apfell implant startup as part of its session key generation
logsource:
    category: file_event
    product: macos
detection:
    selection:
        TargetFilename|startswith: '/private/var/folders'
        TargetFilename|endswith:
            - 'mds/mdsDirectory.db'
            - 'mds/mdsObject.db'
            - 'mds/mds.lock'
            # magic whitespace preserving comment
    falsePositive:
        Image:
            - '/usr/libexec/trustd'
            # magic whitespace preserving comment
    condition: selection and not falsePositive
tags:
    - apfell
level: high
status: experimental

falsepositives:
    - (unknown) Legitimate processes using temporary keychains
